#include <iostream>

int main() {
    int choice;

    std::cout << "Въведете номер на факултет:\n";
    std::cout << "1. Факултет по технически науки\n";
    std::cout << "2. Факултет по природни науки\n";
    std::cout << "3. Факултет по обществени науки\n";
    std::cout << "4. Факултет по обществено здраве и здравни грижи\n";
    std::cout << "5. Медицински факултет\n";
    std::cout << "Въведете вашата опция: ";
    std::cin >> choice;

    switch (choice) {
        case 1:
            std::cout << "Специалности във факултета: Инженерство, Архитектура\n";
            break;
        case 2:
            std::cout << "Специалности във факултета: Биология, Химия\n";
            break;
        case 3:
            std::cout << "Специалности във факултета: Социология, Психология\n";
            break;
        case 4:
            std::cout << "Специалности във факултета: Обществено здраве, Медицинска сестра\n";
            break;
        case 5:
            std::cout << "Специалности във факултета: Обща медицина, Стоматология\n";
            break;
        default:
            std::cout << "Невалиден номер на факултет\n";
            break;
    }

    return 0;
}

